{
  "_name_or_path": "./llama3_SAE",
  "activation": "topk",
  "activation_k": 128,
  "architectures": [
    "LLama3_SAE"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_llama3_SAE.LLama3_SAE_Config",
    "AutoModelForCausalLM": "modeling_llama3_SAE.LLama3_SAE"
  },
  "base_model_name": "meta-llama/Meta-Llama-3-8B",
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "hook_block_num": 25,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "model_type": "llama3_SAE",
  "n_inputs": 4096,
  "n_latents": 12288,
  "normalize": false,
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "tied": false,
  "torch_dtype": "float16",
  "transformers_version": "4.41.2",
  "use_cache": true,
  "vocab_size": 128256
}
